Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory.GetPoint Method
 Gets the point from the given single-point input.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point GetPoint(
	DrawingPluginBase.InputDefinition input
)
Public Shared Function GetPoint (
	input As DrawingPluginBase.InputDefinition
) As Point
Parameters
input
Type: Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition
The input.
Return Value
Type: Point
The point.
See Also
Reference
InputDefinitionFactory Class
Tekla.Structures.Drawing.Tools Namespace